In [182]:
import pandas as pd

In [183]:
import seaborn as sns
import plotly

In [184]:
from datetime import time

In [208]:
df = pd.read_csv('data/dataset_asimov.csv')

In [186]:
df

,Status de Pagamento,Dia,Mês,Meio de Propaganda,Valor Pago,Chamadas Realizadas,Duração da chamada,Modelo de Treinamento,Nivel de Treinamento,Código de Área,Equipe,Consultor
0,Pago,1,Abr,Televisão,R$ 7000000,3,02:00,GK,KJI. L4,A7,Equipe 1,Arthur
1,Pago,10,Ago,Televisão,R$ 11000000,1,02:00,GK,Pre. L8,B13,Equipe 2,Heitor
2,Pago,20,Set,Website,R$ 12000000,3,02:00,GK,Fndn. L5,A1,Equipe 2,Helena
3,Pago,23,Set,Facebook,R$ 15000000,1,02:00,GK,Fndn. L5,A2,Equipe 3,Alice
4,Pago,11,Set,Televisão,R$ 25000000,2,02:00,GK,Fndn. L3,B13,Equipe 4,Theo
...,...,...,...,...,...,...,...,...,...,...,...,...
1232,Não pago,18,Nov,Facebook,R$ 0,2,12:55,NaN,NaN,A1,Equipe 4,Theo
1233,Não pago,24,Nov,WhatsApp,R$ 0,2,12:55,NaN,NaN,A7,Equipe 2,Heitor
1234,Não pago,9,Dez,Televisão,R$ 0,1,12:55,NaN,NaN,A4,Equipe 2,Laura
1235,Não pago,11,Fev,Facebook,R$ 0,2,12:55,NaN,NaN,B18,Equipe 2,Laura
1236,Não pago,12,Mar,Televisão,R$ 0,2,12:55,NaN,NaN,B18,Equipe 3,Sophia

- tratar coluna valor pago

In [209]:
df['Valor Pago'] = df['Valor Pago'].apply(lambda x: x.split(' ')[1])

In [210]:
df['Valor Pago'] = df['Valor Pago'].apply(lambda x: float(x))

- duração de chamada

In [211]:
df['Duração da chamada'] = df['Duração da chamada'].apply(lambda x: str(x))

In [212]:
df['Duração da chamada'] = df['Duração da chamada'].apply(lambda x: time.fromisoformat(x))

In [213]:
df['Horas'] = df['Duração da chamada'].apply(lambda x: x.hour)

In [214]:
df['Minutos'] = df['Duração da chamada'].apply(lambda x: x.minute)

In [215]:
df.drop(columns=['Duração da chamada'], axis=1, inplace=True)

In [216]:
df['Duração da chamada (min)'] = df['Horas'].apply(lambda x: x*60) + df['Minutos']

In [217]:
df.drop(columns=['Horas', 'Minutos'], axis=1, inplace=True)

----

grafico melhor por equipe

mes a mes

In [218]:
df_target = df.loc[df['Mês']=='Jan']

In [219]:
df_target

,Status de Pagamento,Dia,Mês,Meio de Propaganda,Valor Pago,Chamadas Realizadas,Modelo de Treinamento,Nivel de Treinamento,Código de Área,Equipe,Consultor,Duração da chamada (min)
17,Pago,12,Jan,Televisão,11000000.0,1,GK,Pre. L3,C8,Equipe 2,Laura,120
47,Pago,12,Jan,Televisão,11000000.0,1,GK,Pre. L3,C8,Equipe 2,Laura,120
100,Pago,11,Jan,Google Ad,20000000.0,2,CNI,Fndn. L3,A1,Equipe 4,Bernardo,120
101,Pago,14,Jan,Google Ad,15000000.0,2,GK,Pre. L3,A1,Equipe 2,Laura,120
118,Pago,11,Jan,Google Ad,20000000.0,2,CNI,Fndn. L3,A1,Equipe 4,Bernardo,120
...,...,...,...,...,...,...,...,...,...,...,...,...
1144,Não pago,13,Jan,Televisão,0.0,2,NaN,NaN,B12,Equipe 4,Bernardo,555
1145,Pago,12,Jan,Facebook,12000000.0,3,GK,KJI. L4,A1,Equipe 3,Sophia,576
1153,Pago,12,Jan,Facebook,12000000.0,3,GK,KJI. L4,A1,Equipe 3,Sophia,576
1190,Pago,17,Jan,Website,38000000.0,4,BE,Fndn. L5,A2,Equipe 2,Helena,765
1198,Pago,17,Jan,Website,38000000.0,4,BE,Fndn. L5,A2,Equipe 2,Helena,765

In [220]:
df_target = df_target.groupby(['Equipe','Consultor']).agg({'Valor Pago':'sum'})

In [221]:
df_target = df_target.reset_index()
#df_target = df_target.sort_values(by='Valor Pago', ascending=False)

In [200]:
df_target

      Equipe Consultor   Valor Pago
0   Equipe 1      Davi   84000000.0
1   Equipe 1   Lorenzo   70000000.0
2   Equipe 1     Lucas   22000000.0
3   Equipe 2     Bruno          0.0
4   Equipe 2    Heitor   88000000.0
5   Equipe 2    Helena  150000000.0
6   Equipe 2     Laura  132000000.0
7   Equipe 2   Mathias   48000000.0
8   Equipe 3     Alice   24000000.0
9   Equipe 3      João          0.0
10  Equipe 3    Sophia   94000000.0
11  Equipe 4  Bernardo  222000000.0
12  Equipe 4      Theo   50000000.0

In [201]:
df_target_equipe_1 = df_target.loc[df_target['Equipe']=='Equipe 1']
df_target_equipe_1 = df_target_equipe_1.sort_values(by='Valor Pago', ascending=False)

df_target_equipe_2 = df_target.loc[df_target['Equipe']=='Equipe 2']
df_target_equipe_2 = df_target_equipe_2.sort_values(by='Valor Pago', ascending=False)

df_target_equipe_3 = df_target.loc[df_target['Equipe']=='Equipe 3']
df_target_equipe_3 = df_target_equipe_3.sort_values(by='Valor Pago', ascending=False)

df_target_equipe_4 = df_target.loc[df_target['Equipe']=='Equipe 4']
df_target_equipe_4 = df_target_equipe_4.sort_values(by='Valor Pago', ascending=False)

In [203]:
consultor_1 = df_target_equipe_1.iloc[0]['Consultor']
valor_1 = df_target_equipe_1.iloc[0]['Valor Pago']

consultor_2 = df_target_equipe_2.iloc[0]['Consultor']
valor_2 = df_target_equipe_2.iloc[0]['Valor Pago']

consultor_3 = df_target_equipe_3.iloc[0]['Consultor']
valor_3 = df_target_equipe_3.iloc[0]['Valor Pago']

consultor_4 = df_target_equipe_4.iloc[0]['Consultor']
valor_4 = df_target_equipe_4.iloc[0]['Valor Pago']

In [204]:
lista_consultores = [consultor_1, consultor_2, consultor_3, consultor_4]
lista_consultores

['Davi', 'Helena', 'Sophia', 'Bernardo']

In [205]:
lista_valores = [valor_1, valor_2, valor_3, valor_4]
lista_valores

[84000000.0, 150000000.0, 94000000.0, 222000000.0]

In [206]:
df_grafico = pd.DataFrame({'Consultor':lista_consultores, 'Valor Pago':lista_valores})

In [207]:
df_grafico

  Consultor   Valor Pago
0      Davi   84000000.0
1    Helena  150000000.0
2    Sophia   94000000.0
3  Bernardo  222000000.0

ano todo